In [1]:
import pandas as pd

In [2]:
data={
    "Date":["10/02/2011",'11/02/2011','12/02/2011','13/02/2011'],
    "Event":['Music','Poetry','Theartre','Comedy'],
    "Cost":[1000,5000,15000,2000]
}
df=pd.DataFrame(data)
print(df)

         Date     Event   Cost
0  10/02/2011     Music   1000
1  11/02/2011    Poetry   5000
2  12/02/2011  Theartre  15000
3  13/02/2011    Comedy   2000

# a) Add 2 new column discount and discount price.

In [3]:
# Discount

df['Discount']=df['Cost']*0.1
df

         Date     Event   Cost  Discount
0  10/02/2011     Music   1000     100.0
1  11/02/2011    Poetry   5000     500.0
2  12/02/2011  Theartre  15000    1500.0
3  13/02/2011    Comedy   2000     200.0

In [4]:
# Discount Price

df['Discount_price']=df.apply(lambda row: row.Cost - (row.Cost*0.1),axis=1)
df

         Date     Event   Cost  Discount  Discount_price
0  10/02/2011     Music   1000     100.0           900.0
1  11/02/2011    Poetry   5000     500.0          4500.0
2  12/02/2011  Theartre  15000    1500.0         13500.0
3  13/02/2011    Comedy   2000     200.0          1800.0

# b) Add 2 more event data object to the dataset.

In [5]:
df.loc[len(df.index)]=["14/02/2011","Songs",5100,510,5490]
df.loc[len(df.index)]=["15/02/2011","Dance",5200,520,5480]
df

         Date     Event   Cost  Discount  Discount_price
0  10/02/2011     Music   1000     100.0           900.0
1  11/02/2011    Poetry   5000     500.0          4500.0
2  12/02/2011  Theartre  15000    1500.0         13500.0
3  13/02/2011    Comedy   2000     200.0          1800.0
4  14/02/2011     Songs   5100     510.0          5490.0
5  15/02/2011     Dance   5200     520.0          5480.0

# c) Considerd the same dataset from another CSV merge the 2 CSV file and save it.

In [ ]:
df=df.append